import numpy as np
import timeit

print('------' + 'Задача 1' + '------')

oper = input("Введите, 'A' - транспонировать матрицу, 'B' - перемножить матрицы или 'C' - найти ранг матрицы>")
if oper == 'A':   #транспонирование матрицы
    x = input("Введите размер матрицы: 1х2, 2х1, 1х3, 3х1, 2х2, 3х3>")
    if x == '1x2':
        a11 = int(input("Введите 1-ый элемент матрицы>"))
        a12 = int(input("Введите 2-ой элемент матрицы>"))
        matrix = [[a11, a12]]
        trans_matrix = [[matrix[j][i] for j in range(len(matrix))] for i in range(len(matrix[0]))]
        print(trans_matrix, '\n')
    elif x == '2x1':
        a11 = int(input("Введите 1-ый элемент матрицы>"))
        a21 = int(input("Введите 2-ой элемент матрицы>"))
        matrix = [[a11],
                  [a21]]
        trans_matrix = [[matrix[j][i] for j in range(len(matrix))] for i in range(len(matrix[0]))]
        print(trans_matrix, '\n')
    elif x == '1x3':
        a11 = int(input("Введите 1-ый элемент матрицы>"))
        a12 = int(input("Введите 2-ой элемент матрицы>"))
        a13 = int(input("Введите 3-ий элемент матрицы>"))
        matrix = [[a11, a12, a13]]
        trans_matrix = [[matrix[j][i] for j in range(len(matrix))] for i in range(len(matrix[0]))]
        print(trans_matrix, '\n')
    elif x == '3x1':
        a11 = int(input("Введите 1-ый элемент матрицы>"))
        a21 = int(input("Введите 2-ой элемент матрицы>"))
        a31 = int(input("Введите 3-ий элемент матрицы>"))
        matrix = [[a11],
                  [a21],
                  [a31]]
        trans_matrix = [[matrix[j][i] for j in range(len(matrix))] for i in range(len(matrix[0]))]
        print(trans_matrix, '\n')
    elif x == '2x2':
        a11 = int(input("Введите 1-ый элемент матрицы>"))
        a12 = int(input("Введите 2-ой элемент матрицы>"))
        a21 = int(input("Введите 3-ий элемент матрицы>"))
        a22 = int(input("Введите 4-ый элемент матрицы>"))
        matrix = [[a11, a12],
                 [a21, a22]]
        trans_matrix = [[matrix[j][i] for j in range(len(matrix))] for i in range(len(matrix[0]))]
        print(trans_matrix, '\n')
    elif x == '3x3':
        a11 = int(input("Введите 1-ый элемент>"))
        a12 = int(input("Введите 2-ой элемент>"))
        a13 = int(input("Введите 3-ий элемент>"))
        a21 = int(input("Введите 4-ый элемент>"))
        a22 = int(input("Введите 5-ый элемент>"))
        a23 = int(input("Введите 6-ой элемент>"))
        a31 = int(input("Введите 7-ой элемент>"))
        a32 = int(input("Введите 8-ой элемент>"))
        a33 = int(input("Введите 9-ый элемент>"))
        matrix = [[a11, a12, a13],
                 [a21, a22, a23],
                 [a31, a32, a33]]
        trans_matrix = [[matrix[j][i] for j in range(len(matrix))] for i in range(len(matrix[0]))]
        print(trans_matrix, '\n')
    else:
        print("Вы ошиблись, запустите программу заново")
elif oper == 'B': #перемножение матриц
    x = input("Введите размер первой матрицы: 1х2, 2х1, 1х3, 3х1, 2х2, 3х3>")
    if x == '1x2':
        a11 = int(input("Введите 1-ый элемент первой матрицы>"))
        a12 = int(input("Введите 2-ой элемент первой матрицы>"))
        matr1 = [[a11, a12]]
        y = input("Введите размер второй матрицы: 2х1, 2х2>")
        if y == '2x1':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b21 = int(input("Введите 2-ой элемент второй матрицы>"))
            matr2 = [[b11],
                     [b21]]
            c11 = a11*b11 + a12*b21
            matr3 = [[c11]]
            print(matr3)
        elif y == '2x2':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b12 = int(input("Введите 2-ой элемент второй матрицы>"))
            b21 = int(input("Введите 3-ий элемент второй матрицы>"))
            b22 = int(input("Введите 4-ый элемент второй матрицы>"))
            matr2 = [[b11, b12],
                    [b21, b22]]
            c11 = a11*b11 + a12*b21
            c12 = a11*b12 + a12*b22
            matr3 = [[c11, c12]]
            print(matr3)
    elif x == '2x1':
        a11 = int(input("Введите 1-ый элемент первой матрицы>"))
        a21 = int(input("Введите 2-ой элемент первой матрицы>"))
        matr1 = [[a11],
                 [a21]]
        y = input("Введите размер второй матрицы: 1х2, 1х3>")
        if y == '1x2':
            b11 = int(input("Введите 1-ый элемент матрицы>"))
            b12 = int(input("Введите 2-ой элемент матрицы>"))
            matr2 = [[b11, b12]]
            c11 = a11*b11
            c12 = a11*b12
            c21 = a21*b11
            c22 = a21*b12
            matr3 = [[c11, c12],
                     [c21, c22]]
            print(matr3)
        elif y == '1x3':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b12 = int(input("Введите 2-ой элемент второй матрицы>"))
            b13 = int(input("Введите 3-ий элемент второй матрицы>"))
            matr2 = [[b11, b12, b13]]
            c11 = a11*b11
            c12 = a11*b12
            c13 = a11*b13
            c21 = a21*b11
            c22 = a21*b12
            c23 = a21*b13
            matr3 = [[c11, c12, c13],
                     [c21, c22, c23]]
            print(matr3)
    elif x == '1x3':
        a11 = int(input("Введите 1-ый элемент первой матрицы>"))
        a12 = int(input("Введите 2-ой элемент первой матрицы>"))
        a13 = int(input("Введите 3-ий элемент первой матрицы>"))
        matr1 = [[a11, a12, a13]]
        y = input("Введите размер второй матрицы: 3х1, 3х3>")
        if y == '3x1':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b21 = int(input("Введите 2-ой элемент второй матрицы>"))
            b31 = int(input("Введите 3-ий элемент второй матрицы>"))
            matr2 = [[b11],
                     [b21],
                     [b31]]
            c11 = a11*b11 + a12*b21 + a13*b31
            matr3 = [[c11]]
            print(matr3)
        elif y == '3x3':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b12 = int(input("Введите 2-ой элемент второй матрицы>"))
            b13 = int(input("Введите 3-ий элемент второй матрицы>"))
            b21 = int(input("Введите 4-ый элемент второй матрицы>"))
            b22 = int(input("Введите 5-ый элемент второй матрицы>"))
            b23 = int(input("Введите 6-ой элемент второй матрицы>"))
            b31 = int(input("Введите 7-ой элемент второй матрицы>"))
            b32 = int(input("Введите 8-ой элемент второй матрицы>"))
            b33 = int(input("Введите 9-ый элемент второй матрицы>"))
            matr2 = [[b11, b12, b13],
                     [b21, b22, b23],
                     [b31, b32, b33]]
            c11 = a11*b11 + a12*b21 + a13*b31
            c12 = a11*b12 + a12*b22 + a13*b32
            c13 = a11*b13 + a12*b23 + a13*b33
            matr3 = [[c11, c12, c13]]
            print(matr3)
    elif x == '3x1':
        a11 = int(input("Введите 1-ый элемент первой матрицы>"))
        a21 = int(input("Введите 2-ой элемент первой матрицы>"))
        a31 = int(input("Введите 3-ий элемент первой матрицы>"))
        matr1 = [[a11],
                 [a21],
                 [a31]]
        y = input("Введите размер второй матрицы: 1х2, 1х3>")
        if y == '1x2':
            b11 = int(input("Введите 1-ый элемент матрицы>"))
            b12 = int(input("Введите 2-ой элемент матрицы>"))
            matr2 = [[b11, b12]]
            c11 = a11*b11
            c12 = a11*b12
            c21 = a21*b11
            c22 = a21*b12
            c31 = a31*b11
            c32 = a31*b12
            matr3 = [[c11, c12],
                     [c21, c22],
                     [c31, c32]]
            print(matr3)
        elif y == '1x3':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b12 = int(input("Введите 2-ой элемент второй матрицы>"))
            b13 = int(input("Введите 3-ий элемент второй матрицы>"))
            matr2 = [[b11, b12, b13]]
            c11 = a11*b11
            c12 = a11*b12
            c13 = a11*b13
            c21 = a21*b11
            c22 = a21*b12
            c23 = a21*b13
            c31 = a31*b11
            c32 = a31*b12
            c33 = a31*b13
            matr3 = [[c11, c12, c13],
                     [c21, c22, c23],
                     [c31, c32, c33]]
            print(matr3)
    elif x == '2x2':
        a11 = int(input("Введите 1-ый элемент>"))
        a12 = int(input("Введите 2-ой элемент>"))
        a21 = int(input("Введите 3-ий элемент>"))
        a22 = int(input("Введите 4-ый элемент>"))
        matr1 = [[a11, a12],
                 [a21, a22]]
        y = input("Введите размер второй матрицы: 2х1, 2х2>")
        if y == '2x1':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b21 = int(input("Введите 2-ой элемент второй матрицы>"))
            matr2 = [[b11],
                     [b21]]
            c11 = a11*b11 + a12*b21
            c21 = a21*b11 + a22*b21
            matr3 = [[c11],
                     [c21]]
            print(matr3)
        elif y == '2x2':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b12 = int(input("Введите 2-ой элемент второй матрицы>"))
            b21 = int(input("Введите 3-ий элемент второй матрицы>"))
            b22 = int(input("Введите 4-ый элемент второй матрицы>"))
            matr2 = [[b11, b12],
                    [b21, b22]]
            c11 = a11*b11 + a12*b21
            c12 = a11*b12 + a12*b22
            c21 = a21*b11 + a22*b21
            c22 = a21*b12 + a22*b22
            matr3 = [[c11, c12],
                     [c21, c22]]
            print(matr3)
    elif x == '3x3':
        a11 = int(input("Введите 1-ый элемент>"))
        a12 = int(input("Введите 2-ой элемент>"))
        a13 = int(input("Введите 3-ий элемент>"))
        a21 = int(input("Введите 4-ый элемент>"))
        a22 = int(input("Введите 5-ый элемент>"))
        a23 = int(input("Введите 6-ой элемент>"))
        a31 = int(input("Введите 7-ой элемент>"))
        a32 = int(input("Введите 8-ой элемент>"))
        a33 = int(input("Введите 9-ый элемент>"))
        matr1 = [[a11, a12, a13],
                 [a21, a22, a23],
                 [a31, a32, a33]]
        y = input("Введите размер второй матрицы: 3х1, 3х3>")
        if y == '3x1':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b21 = int(input("Введите 2-ой элемент второй матрицы>"))
            b31 = int(input("Введите 3-ий элемент второй матрицы>"))
            matr2 = [[b11],
                     [b21],
                     [b31]]
            c11 = a11*b11 + a12*b21 + a13*b31
            c21 = a21*b11 + a22*b21 + a23*b31
            c31 = a31*b11 + a32*b21 + a33*b31
            matr3 = [[c11],
                     [c21],
                     [c31]]
            print(matr3)
        elif y == '3x3':
            b11 = int(input("Введите 1-ый элемент второй матрицы>"))
            b12 = int(input("Введите 2-ой элемент второй матрицы>"))
            b13 = int(input("Введите 3-ий элемент второй матрицы>"))
            b21 = int(input("Введите 4-ый элемент второй матрицы>"))
            b22 = int(input("Введите 5-ый элемент второй матрицы>"))
            b23 = int(input("Введите 6-ой элемент второй матрицы>"))
            b31 = int(input("Введите 7-ой элемент второй матрицы>"))
            b32 = int(input("Введите 8-ой элемент второй матрицы>"))
            b33 = int(input("Введите 9-ый элемент второй матрицы>"))
            matr2 = [[b11, b12, b13],
                     [b21, b22, b23],
                     [b31, b32, b33]]
            c11 = a11*b11 + a12*b21 + a13*b31
            c12 = a11*b12 + a12*b22 + a13*b32
            c13 = a11*b13 + a12*b23 + a13*b33
            c21 = a21*b11 + a22*b21 + a23*b31
            c22 = a21*b12 + a22*b22 + a23*b32
            c23 = a21*b13 + a22*b23 + a23*b33
            c31 = a31*b11 + a32*b21 + a33*b31
            c32 = a31*b12 + a32*b22 + a33*b32
            c33 = a31*b13 + a32*b23 + a33*b33
            matr3 = [[c11, c12, c13],
                     [c21, c22, c23],
                     [c31, c32, c33]]
            print(matr3)
elif oper == 'C': #определение ранга матрицы
    x = input("Введите размер матрицы:  2х2, 3х3>")
    a = []
    count = 0
    count2 = 0
    if x == '2x2':
        for i in range(4):
            m = int(input("Введите элементы матрицы>"))
            a.append(m)
            if m == 0:
                count += 1
        if count == 4:
            print("Ранг матрицы = 0")
        elif a[0]*a[3]-a[1]*a[2] == 0:
            print("Ранг матрицы = 1")
        else:
            print("Ранг матрицы = 2")
    if x == '3x3':
        for i in range(9):
            m = int(input("Введите элементы  матрицы>"))
            a.append(m)
            if m == 0:
                count += 1
        if a[0]*a[4]-a[1]*a[3] == 0:
            count2 += 1
        if a[1]*a[5]-a[2]*a[4] == 0:
            count2 += 1
        if a[3]*a[7]-a[4]*a[6] == 0:
            count += 1
        if a[4]*a[8]-a[5]*a[7] == 0:
            count2 += 1
        if count == 9:
            print("Ранг матрицы = 0")
        elif count2 == 4:
            print('Ранг матрицы = 1')
        elif a[0]*a[4]*a[8]+a[1]*a[5]*a[6]+a[3]*a[7]*a[2]-(a[2]*a[4]*a[6]+a[1]*a[3]*a[8]+a[0]*a[5]*a[7]) != 0:
            print('Ранг матрицы = 3')
        else:
            print('Ранг матрицы = 2')

print('------' + 'Задача 2' + '------')

# Задача 2

a = int(input('Введите значение a: '))
b = int(input('Введите значение b: '))
c = int(input('Введите значение c: '))
d = int(input('Введите значение d: '))

arr_matrix = np.array([[a, b], [c, d]])

arr_transpose = arr_matrix.transpose()

print(arr_matrix)

print(arr_transpose)

print('------' + 'Задача 3' + '------')


# Задача 3

a = []
for i in range(9):
    a.append(int(input('Введите элементы матрицы>')))
det = a[0]*a[4]*a[8]+a[1]*a[5]*a[6]+a[3]*a[7]*a[2]-(a[2]*a[4]*a[6]+a[1]*a[3]*a[8]+a[0]*a[5]*a[7])
if det == 0:
    print('Обратной матрицы не существует, т.к определитель равен нулю')
else:
    x = [1/det*(a[4]*a[8]-a[7]*a[5]), -1/det*(a[3]*a[8]-a[6]*a[5]), 1/det*(a[3]*a[7]-a[6]*a[4])]
    y = [-1/det*(a[1]*a[8]-a[7]*a[2]), 1/det*(a[0]*a[8]-a[6]*a[2]), -1/det*(a[0]*a[7]-a[6]*a[1])]
    z = [1/det*(a[1]*a[5]-a[4]*a[2]), -1/det*(a[0]*a[5]-a[3]*a[2]), 1/det*(a[0]*a[4]-a[3]*a[1])]
    x[1], y[0] = y[0], x[1]
    x[2], z[0] = z[0], x[2]
    z[1], y[2] = y[2], z[1]
    print(x, y, z, sep='\n')
print(timeit.timeit())

print('--------------------------------------------')

a = np.array([])
a = a.astype(np.int64)
print('Введите элементы матрицы>:')
for i in range(9):
    s = int(input())
    a = np.append(a, s)
a.shape = (3, 3)
temp = np.linalg.matrix_power(a, -1)
print(temp)
print(timeit.timeit())
